//MVS0280 JOB  (SETUP),
//             'VSAM I/O Module',
//             CLASS=A,
//             MSGCLASS=A,
//             MSGLEVEL=(1,1)
//*********************************************************************
//*
//* SYS1.SETUP.CNTL(MVS0280)
//*
//* DESC: VSAMIO Test and Sample modules
//*
//*********************************************************************
//CLEANUP EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 DELETE MVS.VSAMIO.CNTL NONVSAM
 SET MAXCC=0
 SET LASTCC=0
//BUILD   EXEC PGM=IEBUPDTE,PARM=NEW
//SYSPRINT DD  SYSOUT=*
//SYSUT2   DD  DISP=(,CATLG),
//             UNIT=3350,VOL=SER=MVSRES,
//             DCB=SYS1.MACLIB,
//             SPACE=(CYL,(2,2,20)),
//             DSN=MVS.VSAMIO.CNTL
//SYSIN    DD  DATA,DLM=@@
./ ADD NAME=LISTCATE
//LISTCATE JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* LIST CATALOG ENTRY FOR VSTESTES.CLUSTER                           * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//SYSPRINT DD  SYSOUT=A                                                 00080000
//SYSIN    DD  *                                                        00090000
  LISTCAT ALL ENTRY(VSTESTES.CLUSTER)                                   00100000
/*                                                                      00110000
//                                                                      00120000
./ ADD NAME=LISTCATK
//LISTCATK JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* LIST CATALOG ENTRY FOR VSTESTKS.CLUSTER                           * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//SYSPRINT DD  SYSOUT=A                                                 00080000
//SYSIN    DD  *                                                        00090000
  LISTCAT ALL ENTRY(VSTESTKS.CLUSTER)                                   00100000
/*                                                                      00110000
//                                                                      00120000
./ ADD NAME=LISTCATR
//LISTCATR JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* LIST CATALOG ENTRY FOR VSTESTRR.CLUSTER                           * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//SYSPRINT DD  SYSOUT=A                                                 00080000
//SYSIN    DD  *                                                        00090000
  LISTCAT ALL ENTRY(VSTESTRR.CLUSTER)                                   00100000
/*                                                                      00110000
//                                                                      00120000
./ ADD NAME=PRINTE
//PRINTE   JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* PRINT CONTENTS OF CLUSTER VSTESTES.CLUSTER                        * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//DD1      DD  DSN=VSTESTES.CLUSTER,DISP=SHR                            00080000
//SYSPRINT DD  SYSOUT=A                                                 00090000
//SYSIN    DD  *                                                        00100000
  PRINT INFILE(DD1) DUMP                                                00110000
/*                                                                      00120000
//                                                                      00130000
./ ADD NAME=PRINTK
//PRINTK   JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* PRINT CONTENTS OF CLUSTER VSTESTKS.CLUSTER                        * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//DD1      DD  DSN=VSTESTKS.CLUSTER,DISP=SHR                            00080000
//SYSPRINT DD  SYSOUT=A                                                 00090000
//SYSIN    DD  *                                                        00100000
  PRINT INFILE(DD1) DUMP                                                00110000
/*                                                                      00120000
//                                                                      00130000
./ ADD NAME=PRINTR
//PRINTR   JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* PRINT CONTENTS OF CLUSTER VSTESTRR.CLUSTER                        * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS   EXEC PGM=IDCAMS,REGION=4096K                                 00070000
//DD1      DD  DSN=VSTESTRR.CLUSTER,DISP=SHR                            00080000
//SYSPRINT DD  SYSOUT=A                                                 00090000
//SYSIN    DD  *                                                        00100000
  PRINT INFILE(DD1) DUMP                                                00110000
/*                                                                      00120000
//                                                                      00130000
./ ADD NAME=VSTEST01
//VSTEST01 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* DELETE EXISTING SYS2.VSAMTEST.DATA (IF ANY)                       * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS  EXEC PGM=IDCAMS,REGION=1024K                                  00070000
//SYSPRINT DD  SYSOUT=A                                                 00080000
//SYSIN    DD  *                                                        00090000
    DELETE SYS2.VSAMTEST.DATA NONVSAM                                   00100000
/*                                                                      00110000
//*                                                                     00110100
//********************************************************************* 00110200
//* CREATE A SEQUENTIAL DATASET FROM INSTREAM TEST IMAGES             * 00110300
//********************************************************************* 00110400
//*                                                                     00110500
//IEBGENER EXEC PGM=IEBGENER,REGION=128K                                00120000
//SYSIN    DD  DUMMY                                                    00130000
//SYSPRINT DD  SYSOUT=A                                                 00140000
//*                                                                     00150000
//SYSUT2   DD  DSN=SYS2.VSAMTEST.DATA,DISP=(,CATLG,DELETE),             00160000
//             UNIT=3380,VOL=SER=MVS804,SPACE=(TRK,(15),RLSE),          00170000
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)                      00180000
//SYSUT1   DD  *                                                        00190000
0045557001 LISA L FONTAINE      714 SUNSET PLACE           SAN ANTONIO     TX
0130758002 VIRGINIA O RENFRO    2111 BRIDGE AVENUE         BRIDGEPORT      CT
0243081003 JILL W SCHWAB        5641 WASHINGTON STREET     WEST PALM BEACH FL
0366881004 LUCY J CHILDRESS     2777 GUADLAUPE BLVD        ROSWELL         GA
0517579005 DEBRA K RODGERS      1048 WINDHAM COURT         GREENVILLE      SC
0561094006 TAMMY L SCHAEFER     3911 KINGS RIDGE STREET    EUGENE          OR
0593878007 LOUIS W HORTON       9722 EASTHAVEN STREET      DES PLAINES     IL
0725148008 BRIAN A HODGES       4292 BONANZA STREET        ENGLEWOOD       CO
0930005009 RUSSELL B HASTINGS   226 WINDTREE STREET        ALBANY          NY
0994201010 ADOLF S CARLISLE     936 LAKEFRONT AVENUE       ROANOAK         VA
1033846021 CHERYL I TUCKER      660 SHORE ROAD             LOUISVILLE      KY
1098019022 HANNAH F QUIMBY      6151 MAIN COURT            PHOENIX         AZ
1168050023 TAMMY J FRANKLIN     5226 ROSA LINDA ROAD       LOUISVILLE      KY
1371074024 TAMMY M HARMON       243 KINGS RIDGE STREET     GREENVILLE      SC
1442146025 LUCY H ERICKSON      6207 RIDGEWAY AVENUE       KANSAS CITY     MO
1511914026 SAMANTHA J TEMPLETON 1534 SUN MEADOW AVENUE     FORT LAUDERDALE FL
1765093027 DANIEL I GOODWIN     1660 BRIGHT AVENUE         DALLAS          TX
1766129028 JOYCE R NORTON       907 BRANDYWINE CIRCLE      SAN ANTONIO     TX
1778910029 JUDITH H JEFFERSON   766 KNICKERBOCKER PLACE    SIOUX FALLS     SD
1907611030 KEITH E NEWTON       143 BUCKLEY AVENUE         BALDWIN         MO
2119032041 RUTH E GASTON        8754 GARDEN PLACE          FORT LAUDERDALE FL
2121744042 TROY J NORRIS        716 HILLSIDE ROAD          DENTON          TX
2174003043 SHIRLEY V MATTOX     1260 SHORE AVENUE          FALLS VILLAGE   CT
2229822044 LUCY T HAMMOND       587 CARBONDALE COURT       SALINA          KS
2231748045 SCOTT F HABERMANN    336 BALBOA AVENUE          LAGO VISTA      TX
2324761046 EVERETT L HAMMOND    5912 BISHOP AVENUE         KEARNEY         NE
2363024047 REBECCA A GERBLICK   1617 PARKER AVENUE         SALINA          KS
2483871048 SAMANTHA T MOORE     3586 STRAWBERRY COURT      PONCA CITY      OK
2522284049 WANDA J TUCKER       7807 WINDTREE ROAD         SAN ANTONIO     TX
2597002050 HELEN H FONTAINE     852 WESTRIDGE AVENUE       FORT LAUDERDALE FL
2806628061 ANDREW T MORENO      8900 WASHINGTON STREET     PROVIDENCE      RI
2822279062 BEVERLY F WINSTON    5585 CHARLESTON ROAD       BOSTON          MA
2845743063 ZELDA W RANDALL      639 SOUTHLAND ROAD         FOREST HEIGHTS  MD
2858277064 CLARA F BRYANT       529 BARNABY STREET         LOUISVILLE      KY
3071401065 MICHELLE A ROSS      188 EASTHAVEN AVENUE       BUFFALO         NY
3129003066 BILL W BECK          1798 SEABREEZE AVENUE      BOSTON          MA
3284189067 RITA N RENFRO        7881 DAISY COURT           SIOUX FALLS     SD
3489628068 ARNOLD R ELISON      465 MAIN AVENUE            TULSA           OK
3775212069 HANNAH J GLOVER      3791 SEABREEZE STREET      NASHAU          NH
3786163070 REBECCA D DOREN      8730 STRAWBERRY ROAD       SPRING          TX
3851331081 CLIFF J DRAKE        169 SHORE AVENUE           CHICAGO         IL
3912384082 CRAIG O LABROIE      8021 MILL MOUNTAIN PLACE   MURFREESBORO    TN
4077702083 ROLAND P RODGERS     827 MEADOW STREET          TULSA           OK
4093285084 JACK J SCHWAB        250 BUCKLEY PLACE          CHICAGO         IL
4176588085 BRENDA O MCKAY       315 A & M PLACE            LA HABRA        CA
4197550086 TROY S POWERS        1707 BRIDGE STREET         ENGLEWOOD       CO
4318291087 SAMANTHA M HALL      8063 EDMUND AVENUE         SAN ANTONIO     TX
4461486088 SAMANTHA E MORENO    5196 BAYVIEW PLACE         BRIDGEPORT      CT
4514067089 JIM B RIGHT          568 GREEN VALLEY AVENUE    HOUSTON         TX
4588719090 SHIRLEY D JOHNSON    716 COBBS ROAD             TULSA           OK
4776111101 JOSEPH P HAMMOND     6532 BRANDYWINE STREET     PASADENA        CA
4813060102 REBECCA S NORTON     1175 ELLIS COURT           LOUISVILLE      KY
4862587103 JILL M BENSON        170 SIERRA VISTA ROAD      HELENA          MT
4893602104 LAURIE R RAMSEY      902 PECAN VALLEY STREET    PONCA CITY      OK
4934781105 CHERYL H HABERMANN   930 CLIFTWOOD AVENUE       BUFFALO         NY
5105151106 SHIRLEY P TYLER      5262 BRIDGE CIRCLE         FORT COLLINS    CO
5220743107 CHRISTOPHER F MORGAN 9624 BONANZA AVENUE        DOWNEY          CA
5239514108 NATHAN O SCHAEFER    7644 INDUSTRIAL ROAD       EUGENE          OR
5462366109 DIANE P JENNINGS     2454 ROSA LINDA ROAD       KNOXVILLE       TN
5470384110 JILL F ROSS          949 ROSEWOOD STREET        BALDWIN         MO
5582803121 ANGELA J ERWIN       2709 BIENVILLE STREET      NEWPORT BEACH   CA
5618369122 PETER F ALEXANDER    5500 KNICKERBOCKER AVENUE  BINGHAMTON      NY
5731895123 BETTY H BOWERS       3787 WINDWOOD PLACE        SALT LAKE CITY  UT
5764671124 PETER L SCHAEFER     358 ATOLL STREET           PASADENA        CA
5867208125 JOYCE K JENNINGS     1580 ROSA LINDA COURT      TUCSON          AZ
5877149126 ROBERT P GLOVER      6394 PARSON ROAD           NORWALK         CT
5922222127 RUTH N ALEXANDER     259 SEASIDE ROAD           ANNAPOLIS       MD
6007109128 JARED D HILLFORD     879 MICHIGAN AVENUE        PONCA CITY      OK
6131803129 HELEN R DRAKE        263 BENSON STREET          DENVER          CO
6212865130 JOYCE C EUBANKS      516 WESTRIDGE BLVD         WEST BRADENTON  FL
6288450141 DEBRA B JACKSON      7426 PARSON ROAD           MINNEAPOLIS     MN
6315453142 BILL M TEASDALE      608 LINCOLN ROAD           FORT WORTH      TX
6426347143 PATTY C ELISON       5454 LINCOLN AVENUE        DETROIT         MI
6532928144 HANNAH O NEWBURY     3634 SIERRA VISTA STREET   BOSTON          MA
6552938145 BETTY V POWERS       454 JUNIPER AVENUE         ANN ARBOR       MI
6565164146 JACK H EUBANKS       3699 SOUTHLAND PLACE       FREMONT         CA
6613600147 TAMMY O EUBANKS      5230 DAISY AVENUE          KEARNEY         NE
6660837148 BRIAN T PARRISH      751 PECAN VALLEY COURT     ANN ARBOR       MI
6740697149 LARRY O MORENO       6565 JACKSON STREET        EUGENE          OR
6865914150 DEBRA F BOWERS       8793 GARDEN AVENUE         DES PLAINES     IL
6890599161 LARRY G PARKER       827 MEADOW STREET          SAN DIEGO       CA
6911300162 JANET H HAMMOND      5064 GRANT STREET          DES PLAINES     IL
7110260163 BEVERLY K WEAVER     829 HORSESHOE CIRCLE       LA JOLLA        CA
7170298164 KEVIN L FONTAINE     3527 APPLE VALLEY STREET   MISSOULA        MT
7255026165 JERRY S BOWERS       395 ALTAVISTA COURT        SAN DIEGO       CA
7792268166 JOAN C GLOVER        6152 CUMBERLAND AVENUE     NEW YORK        NY
8198053167 RONALD A EUBANKS     378 SHORE STREET           ANCHORAGE       AK
8214332168 ROY P MATTOX         154 SUNSET COURT           WEST PALM BEACH FL
8216798169 ROY F NORRIS         3212 ALTAVISTA BLVD        BOSTON          MA
8309814170 EVERETT A ERWIN      926 BALBOA STREET          OKLAHOMA CITY   OK
8491480181 JOYCE S HODGES       682 PARKER PLACE           CLEVELAND       OH
8544794182 NATHAN R JOHNSON     1034 TWILIGHT ROAD         COVINGTON       LA
8675854183 ANDREW B WINSTON     2458 ELLIS ROAD            SPRING          TX
8763434184 CRAIG I GOODLOW      1667 WASHINGTON ROAD       MONTGOMERY      AL
8969094185 ERNIE N DUNBAR       2830 NORTHFIELD STREET     LOUISVILLE      KY
9235874186 TED R BOWERS         532 PECAN VALLEY STREET    PRESCOTT        AZ
9266973187 ANDREW K CONLEY      689 WINDTREE BLVD          ATLANTA         GA
9445325188 ARNOLD F RAMSEY      8629 LINCOLN CIRCLE        MONTGOMERY      AL
9604395189 JANET M BARBER       1605 GARRETT STREET        LA JOLLA        CA
9962289190 PETER R STUART       870 BALBOA COURT           PHILADELPHIA    PA
/*                                                                      00200000
//                                                                      00210000
./ ADD NAME=VSTEST02
//VSTEST02 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSLVAR     VSAM DATASET: VSTESTK1.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY LOADS VARIABLE LENGTH KSDS DATASET                     00070000
//********************************************************************* 00080000
//*                                                                     00090000
//IDCAMS1 EXEC PGM=IDCAMS,REGION=4096K                                  00100000
//SYSPRINT DD  SYSOUT=A                                                 00110000
//SYSIN    DD  *                                                        00120000
                                                                        00130000
  /* DELETE STUDENT CLUSTER (KSDS VARIABLE LENGTH RECORDS)  */          00140000
                                                                        00150000
  DELETE VSTESTK1.CLUSTER CLUSTER PURGE                                 00160000
                                                                        00170000
  /* DEFINE KSDS CLUSTER                                    */          00180000
                                                                        00190000
  DEFINE CLUSTER (                                      -               00200000
         NAME ( VSTESTK1.CLUSTER                      ) -               00210000
         VOLUMES ( MVS804 )                             -               00220000
         RECORDSIZE ( 19 83   )                         -               00230000
         RECORDS( 50 50    )                            -               00240000
         KEYS ( 10 0 )                                  -               00250000
         INDEXED                                        -               00260000
                  )                                     -               00270000
         DATA (                                         -               00280000
         NAME ( VSTESTK1.DATA                         ) -               00290000
              )                                         -               00300000
         INDEX (                                        -               00310000
         NAME ( VSTESTK1.INDEX                        ) -               00320000
               )                                                        00330000
                                                                        00340000
/*                                                                      00350000
//*                                                                     00360000
//********************************************************************* 00370000
//* LOAD DATASET (VSTESTK1.CLUSTER) FROM SYSIN IMAGES                   00380000
//********************************************************************* 00390000
//*                                                                     00400000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00410000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00420000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00430000
//SYSPRINT DD  SYSOUT=A                                                 00440000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00450000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00460000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00470000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00480000
//SYSLIN   DD  DISP=(,PASS),UNIT=SYSDA,SPACE=(80,(500,100))             00490000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSLVAR),DISP=SHR                 00500000
//*                                                                     00510000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00520000
//             PARM='LIST,XREF,LET'                                     00530000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,DELETE)                       00540000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00550000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00560000
//             SPACE=(1024,(50,20,1))                                   00570000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00580000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00590000
//SYSPRINT DD  SYSOUT=A                                                 00600000
//*                                                                     00610000
//GO01    EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT)              00620000
//SYSOUT   DD  SYSOUT=A                                                 00630000
//SYSUDUMP DD  SYSOUT=A                                                 00640000
//SYSIN    DD  *                                                        00650000
0025654SAMANTHA D. LABROIE   3023 SEASIDE AVENUE      WEST PALM BEACHFL33406FBA
0025654 011001 031002 041503 051504 000000 000000 000000 000000
0034591NELSON E. CHILDRESS   6323 ROSA LINDA STREET   FALLS VILLAGE  CT06031MMAT
0034591 011003 013702 022102 121001 000000 000000 000000 000000
0040736ELIZABETH W. GLOVER   6117 MILLBROOK STREET    ROSWELL        GA30075FPHS
0040736 011002 013703 141401 000000 000000 000000 000000 000000
0043415ROLAND D. JOHNSON     185 VAN ZANDT PLACE      OKLAHOMA CITY  OK73120MCSC
0043415 011002 011501 131011 132011 000000 000000 000000 000000
0054796MIKE T. RICHARDS      258 WINDWOOD ROAD        ST. CLAIR      MI48048MCHE
0054796 011002 031003 041501 051504 000000 000000 000000 000000
0072697HANNAH E. NORTON      268 GRANT COURT          KEARNEY        NE68848FEDU
0072697 011001 031002 041503 051504 000000 000000 000000 000000
0099174CINDY D. MCQUEEN      8589 PECAN VALLEY STREET BALDWIN        MO63022FENG
0099174 011002 011501 091011 091021 000000 000000 000000 000000
0120756SARAH V. MCKENZIE     4292 SEABREEZE COURT     BOSTON         MA02130FEDU
0120756 011001 031002 041503 051504 000000 000000 000000 000000
0136491LAURIE B. REED        3022 GARRETT PLACE       AUSTIN         TX78759FPHS
0136491 011002 013703 141401 000000 000000 000000 000000 000000
0139894SAMANTHA I. HASTINGS  8541 MICHIGAN STREET     SAN ANTONIO    TX78216FART
0139894 011001 011501 013702 022101 000000 000000 000000 000000
0141670RICHARD A. GARLAND    1933 MILL MOUNTAIN AVENUESAN ANTONIO    TX78216MMAT
0141670 011002 011501 013703 121001 000000 000000 000000 000000
0152570HEATHER J. HORTON     1774 MILLBROOK AVENUE    FALLS VILLAGE  CT06031FCHE
0152570 011002 031003 041501 051504 000000 000000 000000 000000
0166305HEATHER J. MORENO     637 ELLIS AVENUE         RIVERSIDE      NJ08370FCHE
0166305 011002 031003 041501 051504 000000 000000 000000 000000
0176560ARNOLD O. HILLFORD    6786 MEADOW STREET       FALLS VILLAGE  CT06031MEDU
0176560 011002 011501 013703 083011 000000 000000 000000 000000
0190433CINDY E. NOELKE       936 WINDTREE CIRCLE      ANCHORAGE      AK99508FBIO
0190433 011002 013703 031001 000000 000000 000000 000000 000000
0194091DEBRA A. NEWTON       6701 SUN MEADOW CIRCLE   ANCHORAGE      AK99508FBA
0194091 011001 031002 041503 051504 000000 000000 000000 000000
0202663RICHARD O. HAMMOND    2300 EDMUND CIRCLE       HATTERAS       NC27943MENG
0202663 011002 031003 041504 091011 000000 000000 000000 000000
0208198JACK D. MEEHAN        7174 COBBS STREET        OKLAHOMA CITY  OK73120MBA
0208198 011002 011501 022001 022101 000000 000000 000000 000000
0223563KATHRYN I. SCHWAB     788 TWILIGHT ROAD        KNOXVILLE      TN37932FCSC
0223563 011003 013702 022102 131011 000000 000000 000000 000000
0243012DIANE G. NOELKE       5460 ELLIS AVENUE        ANCHORAGE      AK99508FART
0243012 011001 011501 013702 022101 000000 000000 000000 000000
0243815JIM N. MEEHAN         892 SAND CREEK STREET    BOISE          ID83714MPHS
0243815 011003 013702 022102 141401 000000 000000 000000 000000
0244106JACOB T. WINSTON      7563 LIVE OAK STREET     PHOENIX        AZ85040MART
0244106 011001 031002 041503 051504 000000 000000 000000 000000
0285887EVERETT K. VANACKER   160 COLISEUM STREET      SALT LAKE CITY UT84109MCSC
0285887 011002 011501 131011 132011 000000 000000 000000 000000
0289051ANN H. BURNETT        644 PARKER ROAD          NEWPORT        RI02840FENG
0289051 011002 031003 041504 091011 000000 000000 000000 000000
0291088ERNIE S. CHILDRESS    3921 HANOVER STREET      GREENVILLE     KY42345MEDU
0291088 011001 031002 041503 051504 000000 000000 000000 000000
0297566LARRY H. ALAN         538 VILLA PARK AVENUE    ST. CLAIR      MI48048MPE
0297566 011002 031003 041504 101101 000000 000000 000000 000000
0306654CALVIN B. RODGERS     916 DESERT STREET        FREMONT        CA94538MEDU
0306654 011002 013703 083011 083031 000000 000000 000000 000000
0318326LOUISE L. PARKER      345 ATOLL STREET         MINNEAPOLIS    MN55437FART
0318326 011001 031002 041503 051504 000000 000000 000000 000000
0322868JANET F. NORRIS       8817 LINCOLN BLVD        BALDWIN        MO63022FCSC
0322868 011002 011501 131011 132011 000000 000000 000000 000000
0331623LUCY B. LANDERS       9830 LIVE OAK BLVD       FALLS VILLAGE  CT06031FCSC
0331623 011002 011501 131011 132011 000000 000000 000000 000000
0342751MARILYN W. JACOBY     440 TWILIGHT STREET      ALBUQUERQUE    NM87108FBA
0342751 011003 013702 022001 031004 000000 000000 000000 000000
0356637KAREN A. TUCKER       2123 MILL MOUNTAIN BLVD  ALBUQUERQUE    NM87108FMAT
0356637 011002 031003 041504 121001 000000 000000 000000 000000
0358768EVERETT R. PARRISH    773 SIERRA VISTA BLVD    SAN ANGELO     TX76903MENG
0358768 011002 011501 091011 091021 000000 000000 000000 000000
0365482BETTY J. NEWTON       2349 SEASIDE AVENUE      SPARKS         NV89431FPHS
0365482 011003 013702 022102 141401 000000 000000 000000 000000
0366869EVELYN C. LANDERS     2078 COLISEUM STREET     BATON ROUGE    LA70805FCSC
0366869 011002 031003 041504 131011 000000 000000 000000 000000
0371633HELEN C. BENSON       6969 MILL MOUNTAIN AVENUEDENTON         TX76201FPHS
0371633 011003 013702 022102 141401 000000 000000 000000 000000
0395489JACK S. HASTINGS      8646 BALBOA STREET       KANSAS CITY    MO64118MBIO
0395489 011002 013703 031001 000000 000000 000000 000000 000000
0405326CALVIN B. BRYANT      536 HORSESHOE CIRCLE     PHOENIX        AZ85040MBA
0405326 011003 013702 022001 031004 000000 000000 000000 000000
0427620TED R. MCKAY          777 STRAWBERRY STREET    RIVERSIDE      NJ08370MBA
0427620 011001 031002 041503 051504 000000 000000 000000 000000
0464796LAURIE N. TEASDALE    396 ROSEWOOD STREET      SAN ANTONIO    TX78216FCHE
0464796 011002 031003 041501 051504 000000 000000 000000 000000
0466722TAMMY T. NEWBURY      8255 ROSEWOOD STREET     ALBUQUERQUE    NM87108FCSC
0466722 011002 011501 131011 132011 000000 000000 000000 000000
0467007LARRY W. WINSTON      602 TAPPAN STREET        ATLANTA        GA30305MART
0467007 011001 031002 041503 051504 000000 000000 000000 000000
0478623KIMBERLY G. GLOVER    7677 LIVE OAK PLACE      EUGENE         OR97402FMAT
0478623 011003 013702 022102 121001 000000 000000 000000 000000
0487226CHARLES K. HALL       264 LAKEFRONT BLVD       PHOENIX        AZ85040MEDU
0487226 011002 011501 013703 083011 000000 000000 000000 000000
0552068TED D. MULL           323 WESTRIDGE ROAD       LAGO VISTA     TX78645MBIO
0552068 011002 013703 031001 000000 000000 000000 000000 000000
0555590CAITLIN I. MEEHAN     211 GUADLAUPE ROAD       DENTON         TX76201FMAT
0555590 011002 031003 041504 121001 000000 000000 000000 000000
0560806HOWARD B. HODGES      9889 INDUSTRIAL STREET   ROCHESTER      NY03840MMAT
0560806 011002 013703 121001 121051 000000 000000 000000 000000
0566030CYBIL M. CONLEY       5786 FOREST ROAD         TAMPA          FL33619FPHS
0566030 011003 013702 022102 141401 000000 000000 000000 000000
0574793WANDA I. LARUE        730 LIVE OAK CIRCLE      CHARLOTTE      NC28262FCSC
0574793 011002 011501 131011 132011 000000 000000 000000 000000
0575617RUSSELL S. ERICKSON   548 FOREST AVENUE        LA HABRA       CA90631MPE
0575617 011002 031003 041504 101101 000000 000000 000000 000000
0591132ERNIE E. GLASSMAN     908 WESTRIDGE ROAD       SAN ANGELO     TX76903MPE
0591132 011002 011501 013703 022311 032002 101101 000000 000000
0597225JIM O. AUSTIN         355 KOBERLIN STREET      GRAND RAPIDS   MN55745MBIO
0597225 011002 031001 041503 051504 000000 000000 000000 000000
0610936BOB A. SCHAEFER       9049 SAND CREEK AVENUE   PONCA CITY     OK74603MPHS
0610936 011002 013703 141401 000000 000000 000000 000000 000000
0612082MARGUERITE K. HASTINGS345 BIENVILLE STREET     ENGLEWOOD      CO80112FMAT
0612082 011002 013703 121001 121051 000000 000000 000000 000000
0612533RONALD I. HODGES      9037 DESERT STREET       KNOXVILLE      TN37932MCHE
0612533 011002 031003 041501 051504 000000 000000 000000 000000
0625143ARNOLD W. PARRISH     6374 BRIARGLEN STREET    DES PLAINES    IL60018MPE
0625143 011003 013702 022102 032001 101101 000000 000000 000000
0637591EVERETT H. BURNETT    230 HANOVER STREET       ROANOAK        VA24014MEDU
0637591 011002 011501 013703 083011 000000 000000 000000 000000
0643686PETER H. HASTINGS     186 TAPPAN PLACE         CHICAGO        IL60611MBA
0643686 011002 011501 022001 022101 000000 000000 000000 000000
0647893SAMANTHA B. HORTON    1389 ROBINHOOD STREET    JUNEAU         AK99801FBA
0647893 011003 013702 022001 031004 000000 000000 000000 000000
0687119LARRY V. WEAVER       3903 BRIGHT STREET       DOWNEY         CA90302MCHE
0687119 011002 013703 041501 000000 000000 000000 000000 000000
0687191CALVIN D. LABROIE     841 SHERIDAN CIRCLE      TAMPA          FL33619MPHS
0687191 011002 013703 141401 000000 000000 000000 000000 000000
0700304MARGUERITE N. HILLFORD1769 WILSHIRE ROAD       MIDLAND        TX79702FMAT
0700304 011003 013702 022102 121001 000000 000000 000000 000000
0713816TED A. FRANKLIN       2964 SHERWOOD STREET     PALM DESERT    CA92211MPE
0713816 011003 013702 022102 032001 101101 000000 000000 000000
0717587DANIEL R. MCKAY       869 MILL MOUNTAIN ROAD   TULSA          OK74135MBA
0717587 011002 011501 022001 022101 000000 000000 000000 000000
0722338WILLIAM K. HALL       318 WESTRIDGE ROAD       DENTON         TX76201MPHS
0722338 011002 031003 041504 141401 000000 000000 000000 000000
0728987SHARON T. YAEGER      1323 VILLA PARK STREET   DETROIT        MI48205FCHE
0728987 011002 031003 041501 051504 000000 000000 000000 000000
0740764ZELDA E. MCKENZIE     1351 BUCKLEY STREET      KANSAS CITY    MO64118FPE
0740764 011003 013702 022102 032001 101101 000000 000000 000000
0748067EVERETT I. RAMSEY     534 INDUSTRIAL AVENUE    PHOENIX        AZ85040MPE
0748067 011002 011501 013703 022311 032002 101101 000000 000000
0748758JACOB K. PARKER       1510 SUNSET COURT        SANTA FE       NM87501MBIO
0748758 011002 013703 031001 000000 000000 000000 000000 000000
0755610TAMMY L. NORRIS       658 BRIARGLEN ROAD       WASHINGTON     DC20009FEDU
0755610 011001 031002 041503 051504 000000 000000 000000 000000
0757139JOAN L. GARLAND       9268 HEDGEWOOD COURT     SPRING         TX77373FBIO
0757139 011002 013703 031001 000000 000000 000000 000000 000000
0766116RONALD M. GARLAND     514 HILLSIDE ROAD        OKLAHOMA CITY  OK73120MART
0766116 011001 031002 041503 051504 000000 000000 000000 000000
0778839JOHN J. JACKSON       932 BURWELL CIRCLE       BRIDGEPORT     CT06605MBIO
0778839 011002 013703 031001 000000 000000 000000 000000 000000
0790544THELMA I. RODGERS     8625 HILLSIDE PLACE      SAN ANGELO     TX76903FBIO
0790544 011003 013702 022102 031001 000000 000000 000000 000000
0791357LOUISE W. HARMON      7886 ATOLL STREET        JUNEAU         AK99801FBA
0791357 011001 031002 041503 051504 000000 000000 000000 000000
0793297LARRY C. GERBLICK     455 KINGS RIDGE ROAD     SAN FRANCISCO  CA94105MEDU
0793297 011001 031002 041503 051504 000000 000000 000000 000000
0793617CLIFF N. WHITE        8002 BRIARGLEN CIRCLE    ANNAPOLIS      MD21402MBIO
0793617 011002 031001 041503 051504 000000 000000 000000 000000
0809327RUTH H. FRANKLIN      347 WHITE SANDY COURT    PRESCOTT       AZ86314FMAT
0809327 011002 031003 041504 121001 000000 000000 000000 000000
0822928DAWN I. FITZGERALD    661 RIVER OAKS BLVD      ST. CLAIR      MI48048FCSC
0822928 011002 011501 131011 132011 000000 000000 000000 000000
0825790LOUIS E. AUSTIN       906 CARBONDALE COURT     KNOXVILLE      TN37932MPHS
0825790 011002 013703 141401 000000 000000 000000 000000 000000
0836832BRENDA F. TUCKER      605 ROSEWOOD CIRCLE      ALBUQUERQUE    NM87108FCSC
0836832 011002 011501 131011 132011 000000 000000 000000 000000
0853058CINDY O. MCKAY        984 PARKWAY STREET       BINGHAMTON     NY11704FMAT
0853058 011002 013703 121001 121051 000000 000000 000000 000000
0853466CLARA T. MORENO       3204 CARBONDALE PLACE    TULSA          OK74135FCSC
0853466 011002 031003 041504 131011 000000 000000 000000 000000
0857212VIRGINIA A. PETERSON  7414 MEADOW CIRCLE       DENVER         CO80256FMAT
0857212 011002 011501 013703 121001 000000 000000 000000 000000
0858241PATTY S. VANACKER     205 STRAWBERRY ROAD      ROANOAK        VA24014FEDU
0858241 011002 013703 083011 083031 000000 000000 000000 000000
0881002ROLAND F. BRYANT      527 HILLSIDE STREET      DENTON         TX76201MMAT
0881002 011003 013702 022102 121001 000000 000000 000000 000000
0888561ERNIE A. HALL         369 GUADLAUPE CIRCLE     LOUISVILLE     KY40207MCHE
0888561 011002 013703 041501 000000 000000 000000 000000 000000
0892174BETTY P. DRAKE        7925 BRIARGLEN CIRCLE    ALBANY         NY12206FCSC
0892174 011002 011501 131011 132011 000000 000000 000000 000000
0928546JOSEPH R. SMITH       7615 ATOLL PLACE         TAMPA          FL33619MCHE
0928546 011002 013703 041501 000000 000000 000000 000000 000000
0935786ROBERT I. BARBER      925 PARKER BLVD          DENTON         TX76201MPHS
0935786 011002 013703 141401 000000 000000 000000 000000 000000
0965296YOLANDA C. LARUE      818 MILL MOUNTAIN BLVD   VALPARAISO     IN46383FBIO
0965296 011002 031001 041503 051504 000000 000000 000000 000000
0967407JANET V. TEASDALE     456 HEDGEWOOD CIRCLE     CHICAGO        IL60611FPHS
0967407 011002 013703 141401 000000 000000 000000 000000 000000
0967791LUCY I. POWERS        1146 BUCKLEY ROAD        ALBUQUERQUE    NM87108FEDU
0967791 011001 031002 041503 051504 000000 000000 000000 000000
0968791BEVERLY L. RICHARDS   8040 SHORE CIRCLE        TULSA          OK74135FPHS
0968791 011003 013702 022102 141401 000000 000000 000000 000000
0970626JILL K. JENNINGS      6941 SOUTHLAND STREET    COLUMBUS       GA31997FMAT
0970626 011003 013702 022102 121001 000000 000000 000000 000000
0979347TOM T. COOK           829 PARSON CIRCLE        MISSOULA       MT59802MEDU
0979347 011001 022002 031003 041504 000000 000000 000000 000000
0982436JOSEPH H. THATCHER    246 WILSHIRE STREET      JUNEAU         AK99801MEDU
0982436 011001 022002 031003 041504 000000 000000 000000 000000
/*                                                                      00670000
//STMASTR  DD  DSN=VSTESTK1.CLUSTER,DISP=OLD                            00680000
//                                                                      00690000
./ ADD NAME=VSTEST03
//VSTEST03 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSMULT     VSAM DATASET: VSTESTK1.CLUSTER (KSDS)    00050000
//*                                          VSTESTK2.CLUSTER (KSDS)    00060000
//*                                          VSTESTK3.CLUSTER (KSDS)    00070000
//*                                          VSTESTK4.CLUSTER (KSDS)    00080000
//*                                                                     00090000
//* ACCESSES 4 KSDS DATASETS SIMULTANEOUSLY                             00100000
//********************************************************************* 00110000
//*                                                                     00120000
//IDCAMS1 EXEC PGM=IDCAMS,REGION=4096K                                  00130000
//SYSPRINT DD  SYSOUT=A                                                 00140000
//SYSIN    DD  *                                                        00150000
                                                                        00160000
  /* DELETE DEPARTMENT TABLE CLUSTER (KSDS FIXED LENGTH RECORDS) */     00170000
                                                                        00180000
  DELETE VSTESTK2.CLUSTER CLUSTER PURGE                                 00190000
                                                                        00200000
  /* DEFINE KSDS CLUSTER                                    */          00210000
                                                                        00220000
  DEFINE CLUSTER (                                      -               00230000
         NAME ( VSTESTK2.CLUSTER                      ) -               00240000
         VOLUMES ( MVS804 )                             -               00250000
         RECORDSIZE ( 32 32   )                         -               00260000
         RECORDS( 20 10    )                            -               00270000
         KEYS (  2 0 )                                  -               00280000
         INDEXED                                        -               00290000
                  )                                     -               00300000
         DATA (                                         -               00310000
         NAME ( VSTESTK2.DATA                         ) -               00320000
              )                                         -               00330000
         INDEX (                                        -               00340000
         NAME ( VSTESTK2.INDEX                        ) -               00350000
               )                                                        00360000
                                                                        00370000
  /* DELETE COURSE TABLE CLUSTER (KSDS FIXED LENGTH RECORDS) */         00380000
                                                                        00390000
  DELETE VSTESTK3.CLUSTER CLUSTER PURGE                                 00400000
                                                                        00410000
  /* DEFINE KSDS CLUSTER                                    */          00420000
                                                                        00430000
  DEFINE CLUSTER (                                      -               00440000
         NAME ( VSTESTK3.CLUSTER                      ) -               00450000
         VOLUMES ( MVS804 )                             -               00460000
         RECORDSIZE ( 56 56   )                         -               00470000
         RECORDS( 120 10   )                            -               00480000
         KEYS (  5 0 )                                  -               00490000
         INDEXED                                        -               00500000
                  )                                     -               00510000
         DATA (                                         -               00520000
         NAME ( VSTESTK3.DATA                         ) -               00530000
              )                                         -               00540000
         INDEX (                                        -               00550000
         NAME ( VSTESTK3.INDEX                        ) -               00560000
               )                                                        00570000
                                                                        00580000
  /* DELETE SECTION TABLE CLUSTER (KSDS FIXED LENGTH RECORDS) */        00590000
                                                                        00600000
  DELETE VSTESTK4.CLUSTER CLUSTER PURGE                                 00610000
                                                                        00620000
  /* DEFINE KSDS CLUSTER                                    */          00630000
                                                                        00640000
  DEFINE CLUSTER (                                      -               00650000
         NAME ( VSTESTK4.CLUSTER                      ) -               00660000
         VOLUMES ( MVS804 )                             -               00670000
         RECORDSIZE ( 17 17   )                         -               00680000
         RECORDS( 230 10   )                            -               00690000
         KEYS (  6 0 )                                  -               00700000
         INDEXED                                        -               00710000
                  )                                     -               00720000
         DATA (                                         -               00730000
         NAME ( VSTESTK4.DATA                         ) -               00740000
              )                                         -               00750000
         INDEX (                                        -               00760000
         NAME ( VSTESTK4.INDEX                        ) -               00770000
               )                                                        00780000
/*                                                                      00790000
//*                                                                     00800000
//********************************************************************* 00810000
//* PREPARE DEPARTMENT TABLE DATA FOR LOADING INTO KSDS DATASET         00820000
//********************************************************************* 00830000
//*                                                                     00840000
//IEBDG1  EXEC PGM=IEBDG,REGION=512K                                    00850000
//SYSPRINT DD  DUMMY                                                    00860000
//SYSIN    DD  *                                                        00870000
  DSD OUTPUT=(DEPTWRK),INPUT=(DEPTSEQ)                                  00880000
  FD NAME=FLD1,LENGTH=32,STARTLOC=1,FROMLOC=1,INPUT=DEPTSEQ             00890000
  CREATE NAME=(FLD1),INPUT=DEPTSEQ                                      00900000
  END                                                                   00910000
/*                                                                      00920000
//DEPTSEQ  DD  *                                                        00930000
01ART
02BUSINESS
03BIOLOGY
04CHEMESTRY
05ECONOMICS
06ACCOUNTING
07FINANCE
08EDUCATION
09ENGLISH
10PHYSICAL EDUCATION
11HISTORY
12MATHEMATICS
13COMPUTER SCIENCE
14PHYSICS
/*                                                                      00950000
//DEPTWRK  DD  UNIT=SYSDA,DISP=(,PASS),SPACE=(TRK,(10,10)),             00960000
//             DCB=(RECFM=FB,LRECL=32,BLKSIZE=320)                      00970000
//*                                                                     00980000
//********************************************************************* 00990000
//* PREPARE COURSE TABLE DATA FOR LOADING INTO KSDS DATASET             01000000
//********************************************************************* 01010000
//*                                                                     01020000
//IEBDG2  EXEC PGM=IEBDG,REGION=512K                                    01030000
//SYSPRINT DD  DUMMY                                                    01040000
//SYSIN    DD  *                                                        01050000
  DSD OUTPUT=(CRSEWRK),INPUT=(CRSESEQ)                                  01060000
  FD NAME=FLD1,LENGTH=56,STARTLOC=1,FROMLOC=1,INPUT=CRSESEQ             01070000
  CREATE NAME=(FLD1),INPUT=CRSESEQ                                      01080000
  END                                                                   01090000
/*                                                                      01100000
//CRSESEQ  DD  *                                                        01110000
01100ART APPRECIATION                                  3
01150SCULPTURE I                                       3
01201INTRODUCTION TO THE HISTORY OF WESTERN ART I      3
01202INTRODUCTION TO THE HISTORY OF WESTERN ART II     3
01284INTERIOR DESIGN: COLOR AND LIGHT                  3
01285HISTORY OF ARCHITECTURE AND INTERIOR DESIGN       3
01302MEDIEVAL ART                                      3
01307ART HISTORY TRAVEL                                6
01370PAINTING III                                      3
01450SCULPTURE IV                                      3
02200INTRODUCTION TO BUSINESS                          3
02210BUSINESS COMMUNICATION                            3
02231MANAGEMENT                                        3
02241INTRODUCTION TO MARKETING                         3
02242CONSUMER BEHAVIOR                                 3
02341INTERNATIONAL BUSINESS                            3
02342MARKETING RESEARCH                                3
03100GENERAL BIOLOGY                                   4
03200INTRODUCTION TO HUMAN GENETICS                    4
03201CELL BIOLOGY                                      4
03210HUMAN ANATOMY                                     4
03250HORTICULTURAL BOTANY                              4
03260INTRODUCTION TO HUMAN BIOLOGY                     4
03305COMPARATIVE CHORDATE ANATOMY                      4
03312MICROBIOLOGY                                      4
03408MOLECULAR BIOLOGY OF THE CELL                     4
03420HISTOLOGY                                         4
04150CONCEPTS OF CHEMISTRY                             4
04160INTRODUCTION TO GEOLOGY                           4
04201GENERAL COLLEGE CHEMISTRY                         4
04251QUANTITATIVE ANALYSIS                             4
04303ORGANIC CHEMISTRY                                 4
04311ENVIRONMENTAL CHEMISTRY                           4
04315PHYSICAL CHEMISTRY                                4
04402ADVANCED ORGANIC CHEMISTRY                        4
04410INSTRUMENTAL ANALYSIS                             4
04415BIOCHEMISTRY                                      4
05150ECONOMIC CONCEPTS                                 3
05201MICROECONOMICS                                    3
05202MACROECONOMICS                                    3
05394QUANTITATIVE METHODS                              3
06211ACCOUNTING PRINCIPLES I                           3
06212ACCOUNTING PRINCIPLES II                          3
06380ACCOUNTING SYSTEMS                                3
06409TAX ACCOUNTING                                    3
06451COST ACCOUNTING                                   3
07200PERSONAL FINANCE                                  3
07321MONEY AND FINANCIAL INSTITUTIONS                  3
07324BUSINESS AND THE PUBLIC SECTOR                    3
08301THE TEACHING OF READING                           3
08303MATHEMATICS FOR THE ELEMENTARY CHILD              3
08309LITERATURE FOR THE CHILD                          3
08403METHODS AND MATERIALS FOR THE PRESCHOOL           3
08405PRESCHOOL CURRICULUM                              3
08412STUDENT TEACHING                                  3
09101COMPOSITION                                       3
09102INTRODUCTION TO LITERARY TYPES                    3
09150STUDIES IN FILM                                   3
09201MAJOR BRITISH WRITERS                             3
09203SURVEY OF AMERICAN LITERATURE                     3
09294INTRODUCTION TO JOURNALISM                        3
09304TOPICS IN MEDIEVAL LITERATURE                     3
09315ADOLESCENT LITERATURE                             3
09320SHAKESPEARE                                       3
09392CREATIVE POETRY WRITING                           3
10110BEGINNING DANCE                                   1
10120BEGINNING INDIVIDUAL SPORT                        1
10140SWIMMING                                          1
10150FITNESS                                           1
10180FIRST AID AND PERSONAL SAFETY                     2
10195ATHLETIC TRAINING                                 3
10197CURRENT HEALTH TOPICS                             3
10245LIFEGUARD TRAINING                                1
10393HEALTH AND PHYSICAL EDUCATION FOR TEACHERS        3
11201AMERICAN HISTORY                                  3
11210WOMEN IN AMERICAN HISTORY                         3
11306AFRICAN-AMERICAN HISTORY                          3
11375THE VIETNAM EXPERIENCE                            3
11408THE COLONIAL AND REVOLUTIONARY ERA                3
11421THE ERA OF THE CIVIL WAR                          3
11455AMERICAN FOREIGN POLICY                           3
12100INTRODUCTION TO MODERN MATHEMATICS                3
12105COLLEGE ALGEBRA                                   3
12110ELEMENTARY FUNCTIONS                              3
12115INTRODUCTION TO CALCULUS                          3
12203THEORY OF NUMBERS                                 3
12205DISCRETE MATHEMATICS                              3
12210CALCULUS AND ANALYTICAL GEOMETRY                  3
12323PROBABILITY AND STATISTICS                        3
12330INTRODUCTION TO NUMERICAL ANALYSIS                3
12401MULTIVARIABLE CALCULUS                            3
12410DIFFERENTIAL EQUATIONS                            3
12413ALGEBRAIC STRUCTURES                              3
13101COMPUTER LITERACY                                 3
13201INTRODUCTION TO COMPUTING                         3
13202DATA STRUCTURES                                   3
13290SOFTWARE WORKSHOP                                 1
13305DATABASE DESIGN AND FILE STRUCTURES               3
13309COBOL                                             3
13310COMPUTER ORGANIZATON                              3
13315ASSEMBLER                                         3
13350PRINCIPLES OF PROGRAMMING LANGUAGES               3
13390SOFTWARE WORKSHOP                                 1
13410OPERATING SYSTEMS AND ARCHITECTURE                3
13420SOFTWARE ENGINEERING                              3
13440ALGORITHM ANALYSIS                                3
13490SOFTWARE WORKSHOP                                 1
14140CONCEPTS OF PHYSICS                               4
14143ASTRONOMY                                         4
14241ELEMENTS OF PHYSICS I                             4
14242ELEMENTS OF PHYSICS II                            4
14251ESSENTIALS OF PHYSICS I                           4
14252ESSENTIALS OF PHYSICS II                          4
14431ANALYTICAL MECHANICS                              4
/*                                                                      01130000
//CRSEWRK  DD  UNIT=SYSDA,DISP=(,PASS),SPACE=(TRK,(10,10)),             01140000
//             DCB=(RECFM=FB,LRECL=56,BLKSIZE=5600)                     01150000
//*                                                                     01160000
//********************************************************************* 01170000
//* PREPARE SECTION TABLE DATA FOR LOADING INTO KSDS DATASET            01180000
//********************************************************************* 01190000
//*                                                                     01200000
//IEBDG3  EXEC PGM=IEBDG,REGION=512K                                    01210000
//SYSPRINT DD  DUMMY                                                    01220000
//SYSIN    DD  *                                                        01230000
  DSD OUTPUT=(SECTWRK),INPUT=(SECTSEQ)                                  01240000
  FD NAME=FLD1,LENGTH=17,STARTLOC=1,FROMLOC=1,INPUT=SECTSEQ             01250000
  CREATE NAME=(FLD1),INPUT=SECTSEQ                                      01260000
  END                                                                   01270000
/*                                                                      01280000
//SECTSEQ  DD  *                                                        01290000
011001MWF  8:00AM
011002TTH  8:00AM
011003MWF  9:00AM
011501TTH  9:30AM
012011MWF 10:00AM
012012TTH 11:00AM
012013MWF 11:00AM
012021TTH 12:30PM
012022MWF 12:00PM
012841TTH  2:00PM
012851MWF  1:00PM
013021MWF  2:00PM
013071TBA  0:00
013701MWF  8:00AM
013702TTH  8:00AM
013703MWF  9:00AM
013704TTH  9:30AM
014501MWF 10:00AM
014502TTH 11:00AM
014503MWF 11:00AM
022001MWF  8:00AM
022002TTH  8:00AM
022101MWF  9:00AM
022102TTH  9:30AM
022311MWF 10:00AM
022411MWF 12:00PM
022412TTH  2:00PM
022413MWF  1:00PM
022421TTH 11:00AM
023411MWF 11:00AM
023421TTH 12:30PM
031001MWF  8:00AM
031002TTH  8:00AM
031003MWF  9:00AM
031004TTH  9:30AM
032001MWF 10:00AM
032002TTH 11:00AM
032011MWF 11:00AM
032101TTH 12:30PM
032102MWF 12:00PM
032501TTH  2:00PM
032601MWF  1:00PM
032602MWF  2:00PM
033051MWF  8:00AM
033121TTH  8:00AM
034081MWF  9:00AM
034201TTH  9:30AM
041501MWF  8:00AM
041502TTH  8:00AM
041503MWF  9:00AM
041504TTH  9:30AM
041601MWF 10:00AM
041602TTH 11:00AM
042011MWF 11:00AM
042012TTH 12:30PM
042511MWF 12:00PM
042512TTH  2:00PM
043031MWF  1:00PM
043111MWF  2:00PM
043151MWF  8:00AM
044021TTH  8:00AM
044101MWF  9:00AM
044151TTH  9:30AM
051501MWF  8:00AM
051502TTH  8:00AM
051503MWF  9:00AM
051504TTH  9:30AM
052011MWF 10:00AM
052012TTH 11:00AM
052013MWF 11:00AM
052021TTH 12:30PM
052022MWF 12:00PM
052023TTH  2:00PM
053941MWF  1:00PM
062111MWF  8:00AM
062112TTH  8:00AM
062113MWF  9:00AM
062121TTH  9:30AM
062122MWF 10:00AM
062123TTH 11:00AM
063801MWF 11:00AM
064091TTH 12:30PM
064511MWF 12:00PM
072001MWF  8:00AM
073211TTH  8:00AM
073241MWF  9:00AM
083011MWF  8:00AM
083012TTH  8:00AM
083013MWF  9:00AM
083031TTH  9:30AM
083032MWF 10:00AM
083033TTH 11:00AM
083091MWF 11:00AM
083092TTH 12:30PM
084031MWF 12:00PM
084032TTH  2:00PM
084051MWF  1:00PM
084121MO   8:00AM
084122TU   8:00AM
084123WE   8:00AM
084124TH   8:00AM
084125FR   8:00AM
091011MWF  8:00AM
091012TTH  8:00AM
091021MWF  9:00AM
091022TTH  9:30AM
091023MWF 10:00AM
091501TTH 11:00AM
091502MWF 11:00AM
092011TTH 12:30PM
092031MWF 12:00PM
092032TTH  2:00PM
092033MWF  1:00PM
092941MWF  2:00PM
092942MWF  8:00AM
092943TTH  8:00AM
093041MWF  9:00AM
093151TTH  9:30AM
093201MWF 10:00AM
093202TTH 11:00AM
093921MWF 11:00AM
101101MWF  8:00AM
101102TTH  8:00AM
101103MWF  9:00AM
101104TTH  9:30AM
101105MWF 10:00AM
101201TTH 11:00AM
101202MWF 11:00AM
101203TTH 12:30PM
101204MWF 12:00PM
101205TTH  2:00PM
101401MWF  1:00PM
101402MWF  2:00PM
101403MWF  8:00AM
101404TTH  8:00AM
101501MWF  9:00AM
101502TTH  9:30AM
101503MWF 10:00AM
101504TTH 11:00AM
101505MWF 11:00AM
101801TTH 12:30PM
101802MWF 12:00PM
101803TTH  2:00PM
101951MWF  1:00PM
101952MWF  2:00PM
101971MWF  8:00AM
101972TTH  8:00AM
102451MWF  9:00AM
103931TTH  9:30AM
103932MWF 10:00AM
103933TTH 11:00AM
112011MWF  8:00AM
112012TTH  8:00AM
112013MWF  9:00AM
112014TTH  9:30AM
112101MWF 10:00AM
112102TTH 11:00AM
112103MWF 11:00AM
113061TTH 12:30PM
113062MWF 12:00PM
113751TTH  2:00PM
114081MWF  1:00PM
114211MWF  2:00PM
114551MWF  8:00AM
121001MWF  8:00AM
121002TTH  8:00AM
121003MWF  9:00AM
121051TTH  9:30AM
121052MWF 10:00AM
121053TTH 11:00AM
121054MWF 11:00AM
121101TTH 12:30PM
121102MWF 12:00PM
121151TTH  2:00PM
121152MWF  1:00PM
122031MWF  2:00PM
122032MWF  8:00AM
122051TTH  8:00AM
122101MWF  9:00AM
122102TTH  9:30AM
123231MWF 10:00AM
123232TTH 11:00AM
123301MWF 11:00AM
124011TTH 12:30PM
124101MWF 12:00PM
124131TTH  2:00PM
131011MWF  8:00AM
131012TTH  8:00AM
132011MWF  9:00AM
132012TTH  9:30AM
132013MWF 10:00AM
132021TTH 11:00AM
132901MO   3:00PM
132902TU   3:00PM
132903WE   3:00PM
132904TH   3:00PM
132905FR   3:00PM
133051MWF 11:00AM
133052TTH 12:30PM
133091MWF 12:00PM
133101TTH  2:00PM
133151MWF  1:00PM
133501MWF  2:00PM
133901MO   3:00PM
133902TU   3:00PM
133903WE   3:00PM
133904TH   3:00PM
133905FR   3:00PM
134101MWF  8:00AM
134201TTH  8:00AM
134401MWF  9:00AM
134901MO   3:00PM
134902TU   3:00PM
134903WE   3:00PM
134904TH   3:00PM
134905FR   3:00PM
141401MWF  8:00AM
141402TTH  8:00AM
141403MWF  9:00AM
141431TTH  9:30AM
141432MWF 10:00AM
142411TTH 11:00AM
142412MWF 11:00AM
142421TTH 12:30PM
142511MWF 12:00PM
142512TTH  2:00PM
142521MWF  1:00PM
144311MWF  2:00PM
/*                                                                      01310000
//SECTWRK  DD  UNIT=SYSDA,DISP=(,PASS),SPACE=(TRK,(10,10)),             01320000
//             DCB=(RECFM=FB,LRECL=17,BLKSIZE=340)                      01330000
//*                                                                     01340000
//********************************************************************* 01350000
//* LOAD VSAM TABLE DATASETS                                            01360000
//********************************************************************* 01370000
//*                                                                     01380000
//IDCAMS2 EXEC PGM=IDCAMS,REGION=4096K                                  01390000
//DEPTWRK  DD  DSN=*.IEBDG1.DEPTWRK,DISP=(OLD,DELETE)                   01400000
//CRSEWRK  DD  DSN=*.IEBDG2.CRSEWRK,DISP=(OLD,DELETE)                   01410000
//SECTWRK  DD  DSN=*.IEBDG3.SECTWRK,DISP=(OLD,DELETE)                   01420000
//SYSPRINT DD  SYSOUT=A                                                 01430000
//SYSIN    DD  *                                                        01440000
  REPRO INFILE(DEPTWRK) OUTDATASET(VSTESTK2.CLUSTER)                    01450000
  REPRO INFILE(CRSEWRK) OUTDATASET(VSTESTK3.CLUSTER)                    01460000
  REPRO INFILE(SECTWRK) OUTDATASET(VSTESTK4.CLUSTER)                    01470000
/*                                                                      01480000
//*                                                                     01490000
//********************************************************************* 01500000
//* ACCESS ALL 4 VSAM DATASETS SIMULTANEOUSLY TO PRINT REPORT           01510000
//********************************************************************* 01520000
//*                                                                     01530000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               01540000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       01550000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           01560000
//SYSPRINT DD  SYSOUT=A                                                 01570000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         01580000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         01590000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         01600000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         01610000
//SYSLIN   DD  DISP=(,PASS),UNIT=SYSDA,SPACE=(80,(500,100))             01620000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSMULT),DISP=SHR                 01630000
//*                                                                     01640000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       01650000
//             PARM='LIST,XREF,LET'                                     01660000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,DELETE)                       01670000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   01680000
//SYSLMOD  DD  DSN=&GODATA2(RUN),DISP=(NEW,PASS),UNIT=SYSDA,            01690000
//             SPACE=(1024,(50,20,1))                                   01700000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 01710000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          01720000
//SYSPRINT DD  SYSOUT=A                                                 01730000
//*                                                                     01740000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT)              01750000
//SYSOUT   DD  SYSOUT=A                                                 01760000
//SYSUDUMP DD  SYSOUT=A                                                 01770000
//STMASTR  DD  DSN=VSTESTK1.CLUSTER,DISP=SHR                            01780000
//DEPTTBL  DD  DSN=VSTESTK2.CLUSTER,DISP=SHR                            01790000
//CRSETBL  DD  DSN=VSTESTK3.CLUSTER,DISP=SHR                            01800000
//SECTTBL  DD  DSN=VSTESTK4.CLUSTER,DISP=SHR                            01810000
//SYSPRINT DD  SYSOUT=A                                                 01820000
//                                                                      01830000
./ ADD NAME=VSTEST99
//VSTEST99 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A          00010000
//*                                                                     00020000
//********************************************************************* 00030000
//* DELETE DATASETS CREATED DURING TEST SUITE                         * 00040000
//********************************************************************* 00050000
//*                                                                     00060000
//IDCAMS  EXEC PGM=IDCAMS,REGION=1024K                                  00070000
//SYSPRINT DD  SYSOUT=A                                                 00080000
//SYSIN    DD  *                                                        00090000
    DELETE SYS2.VSAMTEST.DATA NONVSAM                                   00100000
    DELETE VSTESTES.CLUSTER CLUSTER PURGE                               00110000
    DELETE VSTESTRR.CLUSTER CLUSTER PURGE                               00120000
    DELETE VSTESTKS.CLUSTER CLUSTER PURGE                               00130000
    DELETE VSTESTK1.CLUSTER CLUSTER PURGE                               00140000
    DELETE VSTESTK2.CLUSTER CLUSTER PURGE                               00150000
    DELETE VSTESTK3.CLUSTER CLUSTER PURGE                               00160000
    DELETE VSTESTK4.CLUSTER CLUSTER PURGE                               00170000
/*                                                                      00180000
//                                                                      00190000
./ ADD NAME=VSTESTE1
//VSTESTE1 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//*                            VSAM DATASET: VSTESTES.CLUSTER (ESDS)    00050000
//*                                                                     00060000
//* DELETE AND THE DEFINE ESDS CLUSTER FOR TESTING                      00070000
//********************************************************************* 00080000
//*                                                                     00090000
//IDCAMS  EXEC PGM=IDCAMS,REGION=4096K                                  00100000
//SYSPRINT DD  SYSOUT=A                                                 00110000
//SYSIN    DD  *                                                        00120000
                                                                        00130000
  /* DELETE ESDS CLUSTER                                    */          00140000
                                                                        00150000
  DELETE VSTESTES.CLUSTER CLUSTER PURGE                                 00160000
                                                                        00170000
  /* DEFINE ESDS CLUSTER                                    */          00180000
                                                                        00190000
  DEFINE CLUSTER (                                      -               00200000
         NAME ( VSTESTES.CLUSTER                      ) -               00210000
         VOLUMES ( MVS804 )                             -               00220000
         RECORDSIZE ( 80 80   )                         -               00230000
         RECORDS( 50       )                            -               00240000
         NONINDEXED                                     -               00250000
                  )                                     -               00260000
         DATA (                                         -               00270000
         NAME ( VSTESTES.DATA                         ) -               00280000
               )                                                        00290000
/*                                                                      00300000
//                                                                      00310000
./ ADD NAME=VSTESTE2
//VSTESTE2 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: ESDSLOAD     VSAM DATASET: VSTESTES.CLUSTER (ESDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY LOADS ENTRY SEQUENCED DATASET                          00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(ESDSLOAD),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//IMAGES   DD  DSN=SYS2.VSAMTEST.DATA,DISP=SHR                          00340000
//SYSUDUMP DD  SYSOUT=A                                                 00350000
//ESDSF01  DD  DSN=VSTESTES.CLUSTER,DISP=OLD                            00360000
//                                                                      00370000
./ ADD NAME=VSTESTE3
//VSTESTE3 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: ESDSREAD     VSAM DATASET: VSTESTES.CLUSTER (ESDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READS ALL RECORDS FROM ENTRY SEQUENCED DATASET         00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(ESDSREAD),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//ESDSF01  DD  DSN=VSTESTES.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTE4
//VSTESTE4 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: ESDSUPDT     VSAM DATASET: VSTESTES.CLUSTER (ESDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READS DATASET AND UPDATES SELECTED RECORDS             00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(ESDSUPDT),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//ESDSF01  DD  DSN=VSTESTES.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTE5
//VSTESTE5 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: ESDSADDT     VSAM DATASET: VSTESTES.CLUSTER (ESDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY ADDS (APPENDS) RECORDS ONTO ENTRY SEQUENCED DATASET    00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(ESDSADDT),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSIN    DD  *                                                        00340000
9532957501 JOHN J GLASSMAN      7663 SEASIDE AVENUE        NEWPORT BEACH   CA
1964475502 CAITLIN V BROCKTON   9540 PARKER COURT          KANSAS CITY     MO
9441505503 SUE P MOORE          640 JACKSON STREET         LOS ANGELES     CA
2153945504 LARRY E BENSON       4778 DESERT STREET         LA HABRA        CA
5500563505 CHRISTOPHER P BARBER 1640 GARRETT STREET        FREMONT         CA
9470427506 ZELDA H LOCKETT      314 ROSA LINDA COURT       MONTGOMERY      AL
9271987507 CLARA B ALEXANDER    8427 PECAN VALLEY STREET   BOISE           ID
3849060508 CINDY F EUBANKS      700 WILSHIRE PLACE         DOWNEY          CA
3461449509 ROY H TRUJILLO       298 GREEN VALLEY ROAD      CHARLOTTE       NC
3432742510 KIMBERLY J BLUME     444 BARNABY AVENUE         DETROIT         MI
5611032521 LUCY P LOCKETT       822 GREEN VALLEY STREET    SANTA FE        NM
7652057522 HOWARD F GLASSMAN    417 WESTRIDGE AVENUE       SALINA          KS
1847006523 ROY J PARKER         869 LINCOLN STREET         ALBANY          NY
6041532524 CAITLIN N NEWBURY    2389 SEAVIEW COURT         BATON ROUGE     LA
3036844525 PETER L LABROIE      943 PECAN VALLEY ROAD      DETROIT         MI
/*                                                                      00500000
//SYSUDUMP DD  SYSOUT=A                                                 00510000
//ESDSF01  DD  DSN=VSTESTES.CLUSTER,DISP=OLD                            00520000
//                                                                      00530000
./ ADD NAME=VSTESTK1
//VSTESTK1 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//*                            VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* DELETE AND THE DEFINE KSDS CLUSTER FOR TESTING                      00070000
//********************************************************************* 00080000
//*                                                                     00090000
//IDCAMS  EXEC PGM=IDCAMS,REGION=4096K                                  00100000
//SYSPRINT DD  SYSOUT=A                                                 00110000
//SYSIN    DD  *                                                        00120000
                                                                        00130000
  /* DELETE KSDS CLUSTER                                    */          00140000
                                                                        00150000
  DELETE VSTESTKS.CLUSTER CLUSTER PURGE                                 00160000
                                                                        00170000
  /* DEFINE KSDS CLUSTER                                    */          00180000
                                                                        00190000
  DEFINE CLUSTER (                                      -               00200000
         NAME ( VSTESTKS.CLUSTER                      ) -               00210000
         VOLUMES ( MVS804 )                             -               00220000
         RECORDSIZE ( 80 80   )                         -               00230000
         RECORDS( 50       )                            -               00240000
         KEYS ( 10 0 )                                  -               00250000
         INDEXED                                        -               00260000
                  )                                     -               00270000
         DATA (                                         -               00280000
         NAME ( VSTESTKS.DATA                         ) -               00290000
              )                                         -               00300000
         INDEX (                                        -               00310000
         NAME ( VSTESTKS.INDEX                        ) -               00320000
               )                                                        00330000
/*                                                                      00340000
//                                                                      00350000
./ ADD NAME=VSTESTK2
//VSTESTK2 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSLOAD     VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY LOADS DATASET USING TEST DATA FROM SEQUENTIAL DATASET  00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSLOAD),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//IMAGES   DD  DSN=SYS2.VSAMTEST.DATA,DISP=SHR                          00340000
//SYSUDUMP DD  SYSOUT=A                                                 00350000
//KSDSF01  DD  DSN=VSTESTKS.CLUSTER,DISP=OLD                            00360000
//                                                                      00370000
./ ADD NAME=VSTESTK3
//VSTESTK3 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSREAD     VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READS ALL RECORDS FROM DATASET                         00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSREAD),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//KSDSF01  DD  DSN=VSTESTKS.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTK4
//VSTESTK4 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSUPDT     VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READ RECORDS AND UPDATE OR DELETE SELECTED RECORDS     00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSUPDT),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//KSDSF01  DD  DSN=VSTESTKS.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTK5
//VSTESTK5 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSRAND     VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* RANDOMLY ACCESS DATASET AND ADD, UPDATE, DELETE RECORDS             00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSRAND),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//KSDSF01  DD  DSN=VSTESTKS.CLUSTER,DISP=OLD                            00350000
//SYSIN    DD  *                                                        00360000
A 9532957501 JOHN J GLASSMAN      7663 SEASIDE AVENUE        NEWPORT BEACH   CA
A 1964475502 CAITLIN V BROCKTON   9540 PARKER COURT          KANSAS CITY     MO
A 9441505503 SUE P MOORE          640 JACKSON STREET         LOS ANGELES     CA
A 0045557001 LARRY E BENSON       4778 DESERT STREET         LA HABRA        CA
C 5500563505 CHRISTOPHER P BARBER 1640 GARRETT STREET        FREMONT         CA
C 9966129028 ZELDA H LOCKETT      314 ROSA LINDA COURT       MONTGOMERY      AL
C 9441505503 CLARA B ALEXANDER    8427 PECAN VALLEY STREET   BOISE           ID
D 3849060508 CINDY F EUBANKS      700 WILSHIRE PLACE         DOWNEY          CA
D 3129003066 ROY H TRUJILLO       298 GREEN VALLEY ROAD      CHARLOTTE       NC
/*                                                                      00460000
//                                                                      00470000
./ ADD NAME=VSTESTK6
//VSTESTK6 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: KSDSSSEQ     VSAM DATASET: VSTESTKS.CLUSTER (KSDS)    00050000
//*                                                                     00060000
//* TESTS START AND READ FUNCTIONS AGAINST KSDS DATASET                 00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(KSDSSSEQ),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//KSDSF01  DD  DSN=VSTESTKS.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTR1
//VSTESTR1 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//*                            VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* DELETE AND THE DEFINE RRDS CLUSTER FOR TESTING                      00070000
//********************************************************************* 00080000
//*                                                                     00090000
//IDCAMS  EXEC PGM=IDCAMS,REGION=4096K                                  00100000
//SYSPRINT DD  SYSOUT=A                                                 00110000
//SYSIN    DD  *                                                        00120000
                                                                        00130000
  /* DELETE RRDS CLUSTER                                    */          00140000
                                                                        00150000
  DELETE VSTESTRR.CLUSTER CLUSTER PURGE                                 00160000
                                                                        00170000
  /* DEFINE RRDS CLUSTER                                    */          00180000
                                                                        00190000
  DEFINE CLUSTER (                                      -               00200000
         NAME ( VSTESTRR.CLUSTER                      ) -               00210000
         VOLUMES ( MVS804 )                             -               00220000
         RECORDSIZE ( 80 80   )                         -               00230000
         RECORDS ( 1000    )                            -               00240000
         NUMBERED                                       -               00250000
                  )                                     -               00260000
         DATA (                                         -               00270000
         NAME ( VSTESTRR.DATA                         ) -               00280000
               )                                                        00290000
/*                                                                      00300000
//                                                                      00310000
./ ADD NAME=VSTESTR2
//VSTESTR2 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSLODS     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* SEQUENTAILLY LOADS RECORDS GENERATING SERIAL RELATIVE RECORD #      00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSLODS),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//IMAGES   DD  DSN=SYS2.VSAMTEST.DATA,DISP=SHR                          00340000
//SYSUDUMP DD  SYSOUT=A                                                 00350000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00360000
//                                                                      00370000
./ ADD NAME=VSTESTR3
//VSTESTR3 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSREAD     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READS ALL RECORDS FROM DATASET                         00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSREAD),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTR4
//VSTESTR4 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSLODR     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* RANDOMLY LOADS RECORDS LEAVING EMPTY "DUMMY" RECORD SLOTS           00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSLODR),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//IMAGES   DD  DSN=SYS2.VSAMTEST.DATA,DISP=SHR                          00340000
//SYSUDUMP DD  SYSOUT=A                                                 00350000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00360000
//                                                                      00370000
./ ADD NAME=VSTESTR5
//VSTESTR5 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSUPDT     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* SEQUENTIALLY READ RECORDS AND UPDATE OR DELETE SELECTED RECORDS     00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSUPDT),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
./ ADD NAME=VSTESTR6
//VSTESTR6 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSRAND     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* RANDOMLY ACCESS DATASET AND ADD, UPDATE, OR DELETE RECORDS          00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSRAND),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00350000
//SYSIN    DD  *                                                        00360000
A 9532957501 JOHN J GLASSMAN      7663 SEASIDE AVENUE        NEWPORT BEACH   CA
A 1964475502 CAITLIN V BROCKTON   9540 PARKER COURT          KANSAS CITY     MO
A 9441505503 SUE P MOORE          640 JACKSON STREET         LOS ANGELES     CA
A 0045557001 LARRY E BENSON       4778 DESERT STREET         LA HABRA        CA
C 5500563505 CHRISTOPHER P BARBER 1640 GARRETT STREET        FREMONT         CA
C 9966129028 ZELDA H LOCKETT      314 ROSA LINDA COURT       MONTGOMERY      AL
C 9441505503 CLARA B ALEXANDER    8427 PECAN VALLEY STREET   BOISE           ID
D 3849060508 CINDY F EUBANKS      700 WILSHIRE PLACE         DOWNEY          CA
D 3129003066 ROY H TRUJILLO       298 GREEN VALLEY ROAD      CHARLOTTE       NC
/*                                                                      00460000
//                                                                      00470000
./ ADD NAME=VSTESTR7
//VSTESTR7 JOB 'JAY MOSELEY',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A,         00010000
//             REGION=4096K                                             00020000
//*                                                                     00030000
//********************************************************************* 00040000
//* COBOL MODULE: RRDSSSEQ     VSAM DATASET: VSTESTRR.CLUSTER (RRDS)    00050000
//*                                                                     00060000
//* TESTS START AND READ FUNCTIONS AGAINST RRDS DATASET                 00070000
//********************************************************************* 00080000
//*                                                                     00090000
//COB     EXEC PGM=IKFCBL00,REGION=1024K,                               00100000
//             PARM='LOAD,LIST,DMAP,BUF=8192,LIB'                       00110000
//SYSLIB   DD  DSN=MVS.VSAMIO.SOURCE,DISP=SHR                           00120000
//SYSPRINT DD  SYSOUT=A                                                 00130000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00140000
//SYSUT2   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00150000
//SYSUT3   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00160000
//SYSUT4   DD  UNIT=SYSDA,SPACE=(460,(700,100))                         00170000
//SYSLIN   DD  DSN=&LOADSET,DISP=(MOD,PASS),UNIT=SYSDA,                 00180000
//             SPACE=(80,(500,100))                                     00190000
//SYSIN    DD  DSN=MVS.VSAMIO.SOURCE(RRDSSSEQ),DISP=SHR                 00200000
//*                                                                     00210000
//LKED    EXEC PGM=IEWL,REGION=1024K,COND=(5,LT),                       00220000
//             PARM='LIST,XREF,LET'                                     00230000
//SYSLIN   DD  DSN=*.COB.SYSLIN,DISP=(OLD,PASS)                         00240000
//         DD  DSN=MVS.VSAMIO.OBJECT(VSAMIO),DISP=SHR                   00250000
//SYSLMOD  DD  DSN=&GODATA(RUN),DISP=(NEW,PASS),UNIT=SYSDA,             00260000
//             SPACE=(1024,(50,20,1))                                   00270000
//SYSLIB   DD  DSN=SYS1.COBLIB,DISP=SHR                                 00280000
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))                          00290000
//SYSPRINT DD  SYSOUT=A                                                 00300000
//*                                                                     00310000
//GO      EXEC PGM=*.LKED.SYSLMOD,REGION=1024K,COND=(5,LT,LKED)         00320000
//SYSOUT   DD  SYSOUT=A                                                 00330000
//SYSUDUMP DD  SYSOUT=A                                                 00340000
//RRDSF01  DD  DSN=VSTESTRR.CLUSTER,DISP=OLD                            00350000
//                                                                      00360000
@@
